//في المثال الأول وضعنا شرط في حال لو كانة القيمة x اكبر من y يطبع لنا رسالة يخبرنا بذالك

int x = 10;
int y = 5;
if (x > y)
{
    Console.WriteLine("الرقم الأول اكبر من الرقم الثاني");
}

//في المثال الثاني وضعنا شرط في حال لو كانة القيمة y اقل من x يطبع لنا رسالة يخبرنا بذالك
if (y < x)
{
    Console.WriteLine("الرقم الثاني اقل من الرقم الأول");
}

//في هذا المثال طلبنا من المستخدم أن يقوم بادخال أحد الحرفين في حال قام بادخال حرف y حتظهر له رسالة وفي حال قام بادخل أي رمز لن تظهر له رسالة

Console.WriteLine("قم بادخال الرمز المطلوب");
string str = Console.ReadLine();
if (str == "y")
{
    Console.WriteLine("مرحبا بك");
}